import { Error } from "@/models/models";

export const errorMessage = (error: Error | undefined) => {
  //TODO: check error messages
  switch (error?.code) {
    case 1:
      return "فرمت شماره تلفن وارد شده نادرست می باشد!";
    case 2:
      return "سیستم توانایی تشخیص IP را ندارد!";
    case 3:
      return ". تعداد درخواست های مجاز برای این IP بیش از حد مجاز است! لطفا لحظاتی بعد مجددا تلاش کنید";
    case 4:
      return `رمز عبور برای شما ارسال شده است! لطفا برای ارسال مجدد ${error.wait_for} ثانیه دیگر صبر کنید.`;
    case 5:
      return "متاسفانه ارسال رمز عبور با خطا مواجه شد! لطفا مجددا تلاش کنید.";
    case 6:
      return "خطای کلید!";
    case 7:
      return "متاسفانه خطای نامشخصی رخ داده است! لطفا لحظاتی بعد مجددا تلاش کنید.";
    case 8:
      return "رمز عبور وارد شده منقضی و یا نادرست است! لطفا مجددا تلاش کنید.";
    case 9:
      return "خطای رفرش توکن!";
    case 10:
      return "متاسفانه امکان محاسبه قیمت ارز ها در این زمان وجود ندارد! لطفا لحظاتی بعد مجددا تلاش کنید.";
    case 11:
      return "شناسه ی پنل نادرست است!";
    case 12:
      return `مبلغ فاکتور شما بیش از محدودیت خرید ماهانه است! مبلغ ${error.remain} تومان دیگر باقیمانده است.`;
    case 13:
      return "در صورتی که از حساب شما مبلغ کسر شده است، تا 48 ساعت آینده به حساب شما باز میگردد.";
    case 14:
      return "شناسه ی گروه نادرست است!";
    case 15:
      return "لطفا قبل از پرداخت کد ملی را وارد کنید!";
    case 16:
      return "شناسه ی گیفت کارت نادرست است!";
    case 17:
      return "در صورتی که از حساب شما مبلغ کسر شده است، تا 48 ساعت آینده به حساب شما باز میگردد.";
    case 18:
      return "شناسه ی فاکتور نادرست است!";
    case 19:
      return "فاکتور مورد نظر قبلا تایید شده است!";
    case 20:
      return "متاسفانه حساب کاربری شما توسط ادمین مسدود شده است!";
    case 21:
      return "متاسفانه امکان تغییر کد ملی وجود ندارد! لطفا با پشتیبانی تماس بگیرید.";
    case 22:
      return "فرمت کد ملی وارد شده نادرست می باشد!";
    case 23:
      return "مبلغ خرید مورد نظر قابل قبول نمی باشد!";
    case 24:
      return "متاسفانه موقتا امکان ورود به حساب کاربری وجود ندارد! لطفا لحظاتی بعد مجددا تلاش کنید.";
    case 25:
      return "متاسفانه موقتا امکان خدمات دهی وجود ندارد! لطفا لحظاتی بعد مجددا تلاش کنید.";
    default:
      return "متاسفانه خطای نامشخصی رخ داده است! لطفا لحظاتی بعد مجددا تلاش کنید.";
  }
};
