import React from 'react'

const RulsPage = () => {
  return (
    <div dir='rtl' className='min-h-[800px] w-[70%] bg-gray-100 mx-auto rounded-xl mb-10 max-sm:w-full'>
        <h1 className='mr-6 text-2xl pt-6'>شرایط و قوانین</h1>
        <p className='  mt-4 mx-10 pb-10 text-sm'>
        <h1 className='text-lg pt-4'>قوانین سایت:</h1>

      هنگام استفاده از چنجستون، لازم است که شما شرایط و ضوابط ما را کاملاً مطالعه کرده و با آگاهی کامل آن‌ها را بپذیرید. <br/>با ورود به سایت، شما به طور ضمنی این شرایط را می‌پذیرید. در صورت عدم موافقت با این شرایط، لطفاً از استفاده از سایت خودداری کنید. <br />
وب‌سایت چنجستون طبق قوانین جمهوری اسلامی ایران، قوانین جرائم اینترنتی و مجموعه‌ قوانین و مقررات تجارت الکترونیکی فعالیت داشته و کاربران محترم آن موظف به عدم درج هر‌ گونه مطالب سیاسی و یا مغایر با شئونات اخلاقی و مذهبی کشور می باشند. در غیر این صورت، شناسه‌ کاربری این افراد لغو شده و تبعات این موضوع نیز برعهده‌ کاربر خواهد بود.
در مواقع لازم، چنجستون ممکن است از شما درخواست مدارک شناسایی کند. عدم همکاری در این زمینه ممکن است منجر به مسدودسازی مبالغ واریزی و قطع دسترسی شما شود .<br />
عملیات خرید محصولات در وب‌سایت چنجستون مشمول مجموعه قوانین و مقررات تجارت الکترونیکی بوده و هرگونه تخلف تحت پیگرد قانونی قرار خواهد گرفت. خریدار ضمن خرید اینترنتی محصولات، تعهد می‌دهد که از کلیه‌  قوانین و مقررات خرید اینترنتی محصولات آگاهی کامل دارد.
 <br />اطلاعات شخصی کاربران در وب‌سایت کاملاً محرمانه می‌باشد. بنابراین جهت حفظ حریم اطلاعات شخصی سایر کاربران، کاربر باید تعهد نماید تا عامل تلاش جهت هک کردن هر گونه اطلاعات موجود در سایت نبوده و هیچ‌گونه معاونت یا مشارکتی با اشخاص حقیقی یا حقوقی در این امر نداشته باشد. ضمناً کاربر تعهد می‌نماید که هر گونه اطلاع از توسل به هک کردن اطلاعات توسط شخص یا موسسه‌ دیگر را در اسرع وقت به مدیریت سایت چنجستون اطلاع دهد.
با ثبت‌نام یا جستجو در میان محصولات، اپلیکیشن یا وبسایت چنجستون، کاربر تمایل خود برای دریافت پیشنهادهای تبلیغاتی در قالب ارسال پیامک، ایمیل و پوش‌نوتیفیکیشن را اعلام می‌کند <br />.
کاربران تعهد می‌نمایند که اطلاعات خود را هنگام ثبت‌نام و خرید به صورت صحیح در وب‌سایت وارد کنند. در صورت ورود اطلاعات ناقص يا نادرست، مسئولیت عواقب بعدی این عمل بر عهده‌ی کاربران خواهد بود.
کاربر تعهد می‌نماید هرگونه تغییر در مشخصات فردی خود را در اسرع وقت در وب‌سایت چنجستون اصلاح نماید در غیر این‌صورت این وب‌سایت هیچ مسئولیتی در قبال تبعات ناشی از عدم صحت اطلاعات موجود نخواهد داشت.
 <br />وب‌سایت چنجستون اطلاعات شخصی کاربران را با هیچ مجموعه‌ی دیگری به اشتراک نخواهد گذاشت اما مراجع ذی‌صلاح تنها در صورت بروز موارد مصرح در قانون، امکان استفاده از این اطلاعات را خواهند داشت.
 <br />سفارشات باید از طریق اتصال اینترنتی شخصی شما ثبت شوند. استفاده از پراکسی، وی‌پی‌ان یا سایر روش‌های مخفی‌سازی مکان اینترنتی مجاز نیست.
لطفاً توجه داشته باشید که وبسایت چنجستون هیچ نوع خدمات وبسرویس، API، یا پرداخت سریع ارائه نمی‌کند. هر گونه درخواست یا تلاش برای دستیابی به چنین خدماتی به مراجع ذی‌صلاح گزارش داده خواهد شد.
در صورت اتصال به وب‌سایت چنجستون از طریق سایت های دیگر یا ارجاع کاربر از سایت چنجستون به سایت دیگری، چنجستون مسئولیتی در مورد محتوای این وب‌سايت‌ها بر عهده ندارد. وجود این ارتباطات اینترنتی، به منزله‌ی تایید یا ارتباط چنجستون با تولیدکنندگان آن‌ها نیست.
با توجه به موارد فنی احتمالی مانند قعطی وبسرویس، اختلالات و خطاهای اینترنتی پرداخت مبلغ به منزله خرید قطعی محصول نمی باشد؛ کارشناسان ما بلافاصله بعد از بروز مشکل در پی حل آن و اطلاع رسانی به کاربر خواهند بود.
طبق قوانین جاری کشور، فروش کالا به افراد زیر ۱۸ سال ممنوع می باشد. ( لطفا افراد زیر ۱۸ سال با هماهنگی والدین خود اقدام به خرید نمایند)
لغو سفارشات تنها پیش از تایید نهایی امکان‌پذیر است. پس از تایید نهایی، امکان لغو سفارش وجود نخواهد داشت.
توجه داشته باشید که خرید هر یک از محصولات موجود بر روی وبسایت چنجستون به منزله موافقت و پذیرش کلیه قوانین وبسایت میباشد.
هر کاربر در یک ماه فقط تا سقف 1 میلیون تومان می تواند خرید داشته باشد، جهت خرید بیشتر از 1 میلیون تومان می بایست حساب کاربری از طریق پشتیبانی احراز شود. احراز حساب کاربری از طریق ارسال تصویر کارت ملی و کارت بانکی به نام فرد صورت می پذیرد.


<h1 className='text-lg pt-4'>قوانین خرید گیفت کارت:</h1>
 این کارت‌ها صرفا یک کد کارت هستند که برای ریدیم و شارژ کردن اکانت شما در سایت موردنظر قابل استفاده است. <br />
 گیفت کارت‌های مجازی از طریق پیامک و در صورت تمایل از طریق ایمیل نیز ارسال می‌شوند. <br />
 brبا توجه به مجازی بودن کارت‌ها، امکان ارائه مدارکی از جمله تصویر کارت، رسید، فاکتور و شماره سریال از سمت کمپانی صادر کننده وجود ندارد ولی از سمت چنجستون فاکتور و رسید خرید ارائه می شود. <br />
لطفا قبل از خرید از یکسان بودن کشور حساب کاربری خود و گیفت کارت موردنظر مطمئن شوید<div className="br"></div>
گیفت کارت‌ها تاریخ انقضا و محدودیت زمانی ریدیم کردن ندارند<div className="br"></div>
سایت چنجستون تمامی گیفت کارت ها را تا زمان ارسال به شما گارانتی کامل مینماید و بعد از خرید به دلیل اینکه کد برای شما نمایش داده میشود، قابل عودت نمیباشد. <br />
درصورت عدم فعال سازی کد خریداری شده ، پیگیری باید از طریق کمپانی صادر کننده انجام شود، لذا زمان پاسخگویی برای کدهای مخدوش به کمپانی صادر کننده بستگی دارد. <br />
درصورت بروز هرگونه مشکل در هنگام فعال سازی و استفاده از کد های خریداری شده مجموعه چنجستون تمام تلاش خود را برای رفع مشکل انجام می دهد ولی با توجه به مجازی بودن محصول خریداری شده امکان عودت وجود ندارد. <br />

<h1 className='text-lg pt-4'>قوانین پرداخت ارزی(پرداخت فاکتور ارزی، پرداخت درون برنامه ای، شارژ حساب های خارجی):</h1>
در صورتی که وبسایت مد نظر شما در لیست ارائه شده در قسمت پرداخت ارزی نبود، پیش از ثبت درخواست و پرداخت مبلغ از طریق بخش پشتیبانی، امکان پرداخت را بررسی نمایید.
در صورتی که پرداختی از سمت چنجستون انجام شود و مبلغ آن از حساب مجموعه کسر یا پرداخت در حالت Pending باشد، این پرداخت از سمت چنجستون انجام‌ شده محسوب می‌شود و پرداخت مجدد انجام نخواهد شد<div className="br"></div>
زمانی که پول از کارت‌های ویزا/مسترکارت یا اکانت پی‌پال چنجستون کسر شود، خرید اینترنتی انجام‌شده محسوب می‌شود. در صورتی‌ که پول از حساب چنجستون کسر شود اما سایت موردنظر کاربر خرید را قبول نکند یا به هر دلیلی خطایی به وجود بیاید؛ مسئولیت پیگیری‌ پول پرداخت ‌شده با کاربر است و چنجستون مسئولیتی ندارد. این حالت بیشتر در حساب‌هایی که تراکنش کم دارند و یا تازه افتتاح شده باشند و یا مبلغ بالا به آن‌ها واریز شده باشد بوجود می‌آید.
کاربر مسئول ایجاد اکانت در سایت‌های مختلف است، مگر در مواردی که افتتاح و ایجاد اکانت پس از مراحل پرداخت صورت می‌گیرد. <br />
اگر بعد از خرید، سایت مقصد مدارک بیشتری درخواست کند؛ امکان ارائه‌ی مدرکی از سوی چنجستون وجود ندارد. در چنین شرایطی چنجستون ضمن همکاری با کاربر برای برطرف کردن مشکل تلاش می‌کند. <br />
در صورتی که خرید انجام شود ولی سایت مقصد خدماتی به کاربر ارائه ندهد یا کالای خریداری‌شده را ارسال نکند، چنجستون مسئولیتی ندارد و پیگیری بر عهده‌ کاربر است. <br />
چنجستون روش انجام خرید‌ها را انتخاب می‌کند. برای مثال اگر سایتی هم درگاه پی‌پال داشته باشد و هم درگاه کارت بانکی، چنجستون با توجه به ریسک‌های احتمالی، خرید را با یکی از روش‌ها به تشخیص خود انجام می‌دهد.
تسویه وجه برگشتی از خرید اینترنتی در عرض ۴۸ الی ۷۲ ساعت کاری انجام می‌شود و با نرخ خرید دلار روز برگشت مبلغ به حساب محاسبه خواهد شد. <br />
در صورتی که چنجستون به منظور انجام خرید نیاز به اطلاعاتی از کاربر داشته باشد، لازم است کاربر اطلاعات درخواستی را به صورت فایل PDF یا هرگونه فایل تکست دیگری ارسال کند. برای کاهش ضریب خطا اطلاعات کاربر از فایل ارسالی Copy & Paste می‌شود.
چنجستون تحت هیچ شرایطی خدمات پرداخت در سایت‌هایی که سرویس‌هایی با قابلیت سوءاستفاده برای جاسوسی و سرقت اطلاعات را ارائه می‌دهند، انجام نمی‌دهد. <br />
در صورتی که خریدی انجام شود و توسط سایت مقصد برگشت بخورد، چنجستون کارمزد خرید خود را کم خواهد کرد و معادل مبلغ دلاری را بر مبنای نرخ «خرید دلار اسکناس» روزی که پول برگشت می‌شود، به کاربر برمی‌گرداند. نرخ خرید دلار اسکناس روز با نرخ خرید اینترنتی حدود ۵ درصد تفاوت دارد.
در برخی مواقع پرداخت در سایت‌هایی که زبان آن‌ها غیر از انگلیسی است و زبان انگلیسی ندارند، امکان‌پذیر نیست. <br />
برگشت پول یا دلار به حساب‌های چنجستون حتماً باید با هماهنگی قبلی انجام شود. کاربر نباید مبلغ ارزی را بدون هماهنگی به حساب چنجستون برگشت بزند. <br />
پرداخت در سایت‌هایی که فقط درگاه پی پال دارند و در آن آدرس مشتری ایران است، قابل انجام نیست. <br />
به صورت کلی مجموعه چنجستون تنها مسئول پرداخت مبلغ درخواست‌های کاربران است و در صورتی که پس از پرداخت در سایت مدنظر کاربران،‌ به هر دلیلی قوانین و یا سیاست‌های داخلی سایت‌ها و یا درگاه‌های بین المللی پرداختی آن‌ها تغییراتی داشته باشند که باعث بسته شدن اکانت،‌ غیر فعال شدن خدمات دریافتی و یا هر مشکل احتمالی گردد، مجموعه چنجستون هیچگونه مسئولیتی در قبال اینگونه پیش‌آمدها نخواهد داشت و کلیه پیگیری‌های مورد نیاز باید از سمت کاربر انجام شود. <br />
برای خرید از سایت‌هایی که قوانین سختگیرانه‌ای برای خرید اینترنتی دارند، در برخی مواقع هنگام لاگین کردن سایت چنجستون ممکن است اکانت کاربر بلاک شود. در صورتی که هنگام لاگین کردن سایت چنجستون، اکانت کاربر بلاک شود، کاربر مسئول پیگیری و از بلاک خارج کردن اکانت است. سایت چنجستون مسئولیتی در این قبال ندارد. <br />
مسئولیت تمام پیگیری‌ها بعد از انجام خرید توسط سایت چنجستون بر عهده شخص مشتری می باشد. پس بلافاصله بعد از اعلام تکمیل سفارش توسط سایت چنجستون کاربر باید نسبت به پیگیری خرید اقدام کند. <br />
سایت چنجستون در درگاه بانکی خود فقط پرداخت‌هایی را می‌پذیرد که کاربر با کارت و حساب بانکی خود انجام داده باشد. چنانچه کاربری از کارت یا حساب شخص دیگری استفاده کند، وجه واریز شده به حساب سایت چنجستون برگشت زده می‌شود. برای برگشت زدن بایستی کاربر تصویر کارت ملی و کارت بانکی شخصی که از حساب وی استفاده شده است را برای سایت چنجستون از طریق پشتیبانی ارسال کند. <br />
در صورتی که خرید اینترنتی انجام شود و پول از حساب ما کم شود اما پذیرنده به هر دلیلی پول را برگشت بزند سایت چنجستون ابتدا باید پول را در اکانت خود دریافت کند سپس می‌تواند مبلغ ریالی را به شما تحویل دهد. دقت کنید پروسه برگشت ممکن است حتی گاهی تا ۹۰ روز کاری طول بکشد در هر صورت سایت چنجستون پیگیر برگشت پول نخواهد بود و شخص متقاضی باید از سایتی که پول را برگشت زده درخواست کند تا رسیدگی کند. همچنین این امر مشمول ۵ درصد کارمزد خواهد بود. <br />
سایت چنجستون بررسی و برگشت مبالغ ریفاند خرید‌های اینترنتی را نهایتاً تا 3 ماه بعد از انجام شدن خرید انجام می‌دهد. بعد از آن سایت چنجستون مسئولیتی در قبال آن خرید ندارد. <br />
مبالغی که با ارزهایی غیر از دلار باشد به دلار تبدیل می شود و با نرخ خرید روز دلار چنجستون محاسبه خواهد شد.

        </p>
    </div>
  )
}

export default RulsPage